# SetActiveServer Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SingleServerService..::..SetActiveServer Method
SingleServerService Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetActiveServer(Guid) | Set an active server applicable application-wide for the service. |
| SetActiveServer(Guid, Document) | Change the active server for a specific document. |

# See Also
SingleServerService Class
SingleServerService Members
Autodesk.Revit.DB.ExternalService Namespace